export let qas = [
    {
        "q": "当你遇到新朋友时,你",             // 1 
        "A": {
            "text": "说话的说话时间与聆听的时间相若。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "聆听的时间会比说话的时间多。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪一种是你的一般生活取向?",     //2
        "A": {
            "text": "只管做吧。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "找出多种不同选择。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "你喜欢自己的哪种性格?",               //3
        "A": {
            "text": "冷静而理性。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "热情而体谅。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "你擅长",                  //4
        "A": {
            "text": "在有需要时间时同时协调进行多项工作。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "专注在某一项工作上,直至把它完成为止。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "你参与社交聚会时",            //5
        "A": {
            "text": "总是能认识新朋友。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "只跟几个亲密挚友呆在一起。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "当你尝试了解某些事情时,一般你会",        //6     
        "A": {
            "text": "先要了解细节。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "先了解整体情况,细节容后再谈。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "你对下列哪方面较感兴趣?",         //7
        "A": {
            "text": "知道别人的想法。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "知道别人的感受。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "你较喜欢下列哪个工作?",           //8
        "A": {
            "text": "能让你能迅速和即时做出反应。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "能让你定出目标,然后逐步达成目标的工作。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪一种说法较适合你?",            //9
        "A": {
            "text": "当我与友人尽兴后,我会感到精力充沛,并会继续追求这种欢娱。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "当我与友人尽兴后,我会感到疲累,觉得需要一些空间。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪一种说法较适合你?",             //10
        "A": {
            "text": "我擅长订出一些可行的计划。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "我较有兴趣知道别人的计划和梦想,例如他们会往哪里去?憧憬什么?",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "下列哪一种说法较适合你?",             //11
        "A": {
            "text": "我会突然尝试做某些事,看看会有什么事情发生。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "我尝试做任何事前,都想事先知道可能有什么事情发生。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "下列哪一种说法较适合你",          //12
        "A": {
            "text": "我经常边说话,边思考。 ",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "我在说话前,通常会思考要说的话。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "四周的实际环境对我很重要,而且会影响我的感受。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "如果我喜欢所做的事情,气氛对我而言并不是那么重要。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "我喜欢分析,心思缜密。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "我对人感兴趣,关心他们所发生的事。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "即使已出计划,我也喜欢探讨其它新的方案。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "一旦定出计划,我便希望能依计行事。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "认识我的人,一般都知道什么对我来说是重要的。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "除了我感觉亲近的人,我不会对人说出什么对我来说是重要的。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "如果我喜欢某种活动,我会经常进行这种运动。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "我一旦熟悉某种活动后,便希望转而尝试其它新的活动。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "当我作决定的时候,我更多地考虑正反两面的观点,并且会推理与质证。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "当我作决定的时候,我会更多地了解其他人的想法,并希望能够达成共识。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "当我专注做某件事情时,需要不时停下来休息。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "这里是一个答当我专注做某件事情时,不希望受到任何干扰。案",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "我独处太久,便会感到不安。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "若没有足够的自处时间,我便会感到烦躁不安。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "我对一些没有实际用途的意念不感兴趣。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "我喜欢意念本身,并享受想象意念的过程。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪一种说法较适合你",
        "A": {
            "text": "这里是一个答当进行谈判时,我依靠自己的知识和技巧。案",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "当进行谈判时,我会拉拢其他人至同一阵线。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "这里是一当你放假时,你多数会",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "这里是一个题这里是一当你放假时,你多数会目",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "这里是一当你放假时,你多数会",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "这里是一当你放假时,你多数会",
        "A": {
            "text": "2这里是一个答案",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "2这里是一个答案",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "这里是一当你放假时,你多数会",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "这里是一当你放假时,你多数会",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "别人认为我会公正处事,并且尊重他人。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "别人相信在他们有需要时,我会在他们身边。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "随机应变。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "这里是一个答按照计划行事。 ",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "坦率。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "深沉。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "留意事实。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "注重事实。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "知识广博。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "善解人意。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "容易适应转变。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "处事井井井有条。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "爽朗。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "沉温。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "实事求是。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "富想象力。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "喜欢询问实情。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "喜欢探索感受。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "不断接受新意见。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "这里是一个答着眼达成目标。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "率直。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "内敏。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "事实求是。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "具远大目光。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "下列哪个说法最能贴切形容你对自己的看法?",
        "A": {
            "text": "公正。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "宽容。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "你会倾向",
        "A": {
            "text": "暂时放下不愉快的事情,直至有心情时才处理。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "及时处理不愉快的事情,务求把它们抛诸脑后。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "你会倾向",
        "A": {
            "text": "自己的工作被欣赏,即使你自己并不满意。",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "创造一些有长远价值的东西,但不一定需要别人知道是你做的。",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "你会倾向",
        "A": {
            "text": "这里是一个答在自己有兴趣的范畴,积累丰富的经验。",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "有各式各样不同的经验。",
            "value": 0,
            "tag": "J"
        }
    },
    {
        "q": "哪一句较能表达你的看法?",
        "A": {
            "text": "感情用事的人较容易犯错。",
            "value": 0,
            "tag": "E"
        },
        "B": {
            "text": "逻辑思维会令人自以为是,因而容易犯错。",
            "value": 0,
            "tag": "I"
        }
    },
    {
        "q": "哪一句较能表达你的看法?",
        "A": {
            "text": "三思而后行。",
            "value": 0,
            "tag": "S"
        },
        "B": {
            "text": "犹豫不决必失败。",
            "value": 0,
            "tag": "N"
        }
    },
    {
        "q": "这里是一个题目",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "T"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "F"
        }
    },
    {
        "q": "这里是一个题目",
        "A": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "P"
        },
        "B": {
            "text": "这里是一个答案",
            "value": 0,
            "tag": "J"
        }
    }
]


export let result = {
    "E": 0,
    "I": 0,
    "N": 0,
    "S": 0,
    "T": 0,
    "F": 0,
    "P": 0,
    "J": 0
}

